/***************************************************************************
 *             chm_lib.c - CHM archive manipulation routines               *
 *                           -------------------                           *
 *                                                                         *
 *  author:     Jed Wing <jedwin@ugcs.caltech.edu>                         *
 *  version:    0.3                                                        *
 *  notes:      These routines are meant for the manipulation of microsoft *
 *              .chm (compiled html help) files, but may likely be used    *
 *              for the manipulation of any ITSS archive, if ever ITSS     *
 *              archives are used for any other purpose.                   *
 *                                                                         *
 *              Note also that the section names are statically handled.   *
 *              To be entirely correct, the section names should be read   *
 *              from the section names meta-file, and then the various     *
 *              content sections and the "transforms" to apply to the data *
 *              they contain should be inferred from the section name and  *
 *              the meta-files referenced using that name; however, all of *
 *              the files I've been able to get my hands on appear to have *
 *              only two sections: Uncompressed and MSCompressed.          *
 *              Additionally, the ITSS.DLL file included with Windows does *
 *              not appear to handle any different transforms than the     *
 *              simple LZX-transform.  Furthermore, the list of transforms *
 *              to apply is broken, in that only half the required space   *
 *              is allocated for the list.  (It appears as though the      *
 *              space is allocated for ASCII strings, but the strings are  *
 *              written as unicode.  As a result, only the first half of   *
 *              the string appears.)  So this is probably not too big of   *
 *              a deal, at least until CHM v4 (MS .lit files), which also  *
 *              incorporate encryption, of some description.               *
 *                                                                         *
 * switches (Linux only):                                                  *
 *              CHM_USE_PREAD: compile library to use pread instead of     *
 *                             lseek/read                                  *
 *              CHM_USE_IO64:  compile library to support full 64-bit I/O  *
 *                             as is needed to properly deal with the      *
 *                             64-bit file offsets.                        *
 ***************************************************************************/

/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU Lesser General Public License as        *
 *   published by the Free Software Foundation; either version 2.1 of the  *
 *   License, or (at your option) any later version.                       *
 *                                                                         *
 ***************************************************************************/

#include <stdlib.h>
#include <string.h>
#include <limits.h>
#include <stdio.h>

#ifdef WIN32
#include <windows.h>
#include <malloc.h>
#define strcasecmp stricmp
#define strncasecmp strnicmp
#else
/* basic Linux system includes */
/* #define _XOPEN_SOURCE 500 */
#include <unistd.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
/* #include <dmalloc.h> */
#endif

#include "chm_lib.h"
#include "lzx.h"

//#define CHM_DEBUG 1

#ifndef CHM_MAX_BLOCKS_CACHED
#define CHM_MAX_BLOCKS_CACHED 5
#endif

/* names of sections essential to decompression */
static const char CHMU_RESET_TABLE[] =
    "::DataSpace/Storage/MSCompressed/Transform/"
    "{7FC28940-9D31-11D0-9B27-00A0C91E9C7C}/"
    "InstanceData/ResetTable";
static const char CHMU_LZXC_CONTROLDATA[] = "::DataSpace/Storage/MSCompressed/ControlData";
static const char CHMU_CONTENT[] = "::DataSpace/Storage/MSCompressed/Content";

/* structure of ITSF headers */
#define CHM_ITSF_V2_LEN 0x58
#define CHM_ITSF_V3_LEN 0x60
typedef struct itsf_hdr {
    char signature[4];       /*  0 (ITSF) */
    int32_t version;         /*  4 */
    int32_t header_len;      /*  8 */
    int32_t unknown_000c;    /*  c */
    uint32_t last_modified;  /* 10 */
    uint32_t lang_id;        /* 14 */
    uint8_t dir_uuid[16];    /* 18 */
    uint8_t stream_uuid[16]; /* 28 */
    int64_t unknown_offset;  /* 38 */
    int64_t unknown_len;     /* 40 */
    int64_t dir_offset;      /* 48 */
    int64_t dir_len;         /* 50 */
    int64_t data_offset;     /* 58 (Not present before V3) */
} itsf_hdr;

/* structure of ITSP headers */
#define CHM_ITSP_V1_LEN 0x54
typedef struct itsp_hdr {
    char signature[4];        /*  0 (ITSP) */
    int32_t version;          /*  4 */
    int32_t header_len;       /*  8 */
    int32_t unknown_000c;     /*  c */
    uint32_t block_len;       /* 10 */
    int32_t blockidx_intvl;   /* 14 */
    int32_t index_depth;      /* 18 */
    int32_t index_root;       /* 1c */
    int32_t index_head;       /* 20 */
    int32_t unknown_0024;     /* 24 */
    uint32_t num_blocks;      /* 28 */
    int32_t unknown_002c;     /* 2c */
    uint32_t lang_id;         /* 30 */
    uint8_t system_uuid[16];  /* 34 */
    uint8_t unknown_0044[16]; /* 44 */
} itsp_hdr;

/* structure of PMGL headers */
static const char _chm_pmgl_marker[4] = "PMGL";
#define CHM_PMGL_LEN 0x14
typedef struct pgml_hdr {
    char signature[4];     /*  0 (PMGL) */
    uint32_t free_space;   /*  4 */
    uint32_t unknown_0008; /*  8 */
    int32_t block_prev;    /*  c */
    int32_t block_next;    /* 10 */
} pgml_hdr;

/* structure of LZXC reset table */
#define CHM_LZXC_RESETTABLE_V1_LEN 0x28
struct chmLzxcResetTable {
    uint32_t version;
    uint32_t block_count;
    uint32_t unknown;
    uint32_t table_offset;
    int64_t uncompressed_len;
    int64_t compressed_len;
    int64_t block_len;
}; /* __attribute__ ((aligned (1))); */

/* structure of LZXC control data block */
#define CHM_LZXC_MIN_LEN 0x18
#define CHM_LZXC_V2_LEN 0x1c
struct chmLzxcControlData {
    uint32_t size;            /*  0        */
    char signature[4];        /*  4 (LZXC) */
    uint32_t version;         /*  8        */
    uint32_t resetInterval;   /*  c        */
    uint32_t windowSize;      /* 10        */
    uint32_t windowsPerReset; /* 14        */
    uint32_t unknown_18;      /* 18        */
};

#define MAX_CACHE_BLOCKS 128

/* the structure used for chm file handles */
typedef struct chm_file {
#ifdef WIN32
    HANDLE fd;
#else
    int fd;
#endif

    itsf_hdr itsf;
    itsp_hdr itsp;

    int64_t dir_offset;
    int64_t dir_len;

    chm_unit_info rt_unit;
    chm_unit_info cn_unit;
    struct chmLzxcResetTable reset_table;

    /* LZX control data */
    int compression_enabled;
    uint32_t window_size;
    uint32_t reset_interval;
    uint32_t reset_blkcount;

    /* decompressor state */
    struct LZXstate* lzx_state;
    int lzx_last_block;
    uint8_t* lzx_last_block_data;

    /* cache for decompressed blocks */
    uint8_t* cache_blocks[MAX_CACHE_BLOCKS];
    int64_t cache_block_indices[MAX_CACHE_BLOCKS];
    int cache_num_blocks;

    chm_entry **entries_cached;
    int n_entries_cached;
} chm_file;

/* structure of PMGI headers */
static const char _chm_pmgi_marker[4] = "PMGI";
#define CHM_PMGI_LEN 0x08
